{
  "resort": "jacksonhole",
  "resortName": "Jackson Hole",
  "date": "2026-01-10",
  "generated": "2026-01-11T04:44:17.467Z",
  "rawData": {
    "snow": {
      "overnight_inches": 3,
      "overnight_cm": 8,
      "24hour_inches": 3,
      "24hour_cm": 8,
      "48hour_inches": 6,
      "48hour_cm": 15,
      "7day_inches": 38,
      "7day_cm": 97,
      "season_total_inches": 216,
      "season_total_cm": 549,
      "conditions": {
        "today": "6 AM- The weekend is finally here, so come treat yourself right. We squeezed out a sneaky three-inch touch-up overnight, guaranteeing you a Saturday shred of pure powder delight. Lingering flurries will fizzle this morning, leaving behind partly cloudy skies by midday. Seasonable temperatures will reach just into the teens atop Rendezvous Mountain while the Village climbs its way into the upper 20s. An added chill will come from light to moderate northwest winds breezing in the 5-25 mph range. Weekends were made to destroy the mundane. So, get out here! Because whether your game is found deep in the fluffy domain or you just want to rip a fresh corduroy lane, we've got the sensations that'll send you happily insane. -Lege",
        "yesterday": "6 AM- Up and at 'em! It's time to wake from that dull slumber and step into the real dream. The week-long snowstorm pulled out of the Tetons yesterday evening after depositing a final 3 inches of light-density duff during the day. Broken cloud cover today will allow for occasional solar rays to drop through the sapphire spots and illuminate the slopes with sparkles. Cool temperatures will top out in the single digits outside the Corbet's Cabin House of Warm Waffle Delights and in the low to mid 20s down in the Village. A moderate wind from the west-northwest will add a little extra briskness as it clocks in between 10 and 30 mph. Don't let rigid old rationality chain you to a life of bland conventionality. Join the cult of verticality and let ridiculous notions lead you to a fresh mentality. -Lege"
      }
    },
    "lifts": {
      "available": true,
      "yesterday": {
        "date": "2026-01-09",
        "avgWaitTime": 0,
        "maxWaitTime": 0,
        "totalLiftsTracked": 13,
        "busiest": []
      }
    }
  },
  "computedInsights": {
    "flags": {
      "hasFreshSnow": true,
      "isPowderDay": false,
      "highLiftDemand": false
    },
    "alerts": [
      "3\" fresh snow overnight"
    ],
    "trends": [
      "Great week for snow - 38\" in last 7 days"
    ],
    "recommendations": []
  },
  "morningBrief": null,
  "errors": []
}